Option Infer On
Imports System

Module Program
	Sub Main(args As String())
		Dim a As Integer = Nothing ' Текущий код
		Dim b As Integer = Nothing ' Целевой код
		Dim m As Integer = 0 ' Количество цифр целевого кода
		Dim n As Integer = 0 ' Количесво цифр текущего кода
		Dim total_moves As Integer = 0 ' число перемещений дисков кодового замка
		Dim a1, b1 As Integer ' Временные переменные для работы с комбинациями кодового замка
		' Ввод данных: целевой и текущий код
		' вводятся как четырехзначные числа
		Console.Write("Введите текущий код: ")
		Integer.TryParse(Console.ReadLine(), a)
		Console.Write("Введите целевой код: ")
		Integer.TryParse(Console.ReadLine(), b)
		a1 = a : b1 = b
		' Количество цифр текущего кода
		Do While a1 > 0 ' Условие выполнения цикла
			m += 1 ' Счётчик числа цифр увеличили на 1
			a1 \= 10 ' Число уменьшили в 10 раз
		Loop
		' Количество цифр целевого кода
		Do While b1 > 0 ' Условие выполнения цикла
			n += 1 ' Счётчик числа цифр увеличили на 1
			b1 \= 10 ' Число уменьшили в 10 раз
		Loop
		' Проверка на совпадение длины текущего и целевого кода
		' Если длина текущего кода не равна длине целевого
		' и оба кода не четырёхзначные, программа завершает работу.
		If (m <> 4) OrElse (n <> 4) OrElse (m <> n) Then
			Console.WriteLine("Комбинация кодового замка должна быть 4 цифры.")
			Console.WriteLine("Текущий и целевой код должны быть одинаковой длины.")
			Console.Read() ' Задержка вывода до нажатия клавиши "Ввод"
			Environment.Exit(0) ' Выход из программы
		End If
		a1 = a : b1 = b
		' Перебор цифр текущего и целевого кода
		Do While (a1 > 0) AndAlso (b1 > 0)
			Dim d1 = a1 Mod 10 ' Цифра текущего кода
			Dim d2 = b1 Mod 10 ' Цифра целевого кода
			Dim diff1 = Math.Abs(d1 - d2) ' разность цифр, прямой ход диска
			Dim diff2 = 10 - Math.Abs(d1 - d2) ' разность цифр, обратный ход диска
			' Мнинимальное число ходов - разность между каждой цифрой диска
			' в целевом коде и текущем коде замка сейфа
			total_moves += Math.Min(diff1, diff2)
			a1 \= 10 ' Переход к следующей цифре текущего кода
			b1 \= 10 ' Переход к следующей цифре целевого кода
		Loop
		' Вывод информации на экран
		Console.WriteLine($"Текущий код:{a}")
		Console.WriteLine($"Целевой код:{b}")
		Console.WriteLine($"Мнинимальное число ходов:{total_moves}")
		Console.Read() ' Задержка вывода до нажатия клавиши "Ввод"
	End Sub
End Module